app/views/albums/_form.html.erb

SELECT "albums".* FROM "albums"
---
  <label>
    <% Album::KIND.each do |kind| %>