app/controllers/bands_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Metallica213"], ["updated_at", "2019-02-28 04:12:04.290598"], ["id", 1]]
---
  def update
    @band = Band.find_by(id: params[:id])
    if @band.update_attributes(band_params)

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]
---
  def destroy
    @band = Band.find_by(id: params[:id])
    if @band.destroy