app/controllers/tracks_controller.rb

  def show
    # /tracks/:id
    @track = Track.find_by(id: params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    # /albums/:album_id/tracks/new
    @track = Track.new
    @album = Album.find_by(id: params[:album_id])
    @albums = Album.all
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"

  def create
    @track = Track.new(track_params)
    if @track.save
---
INSERT INTO "tracks" ("created_at", "updated_at", "album_id", "title", "ord", "type_track") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2019-03-01 00:25:55.348996"], ["updated_at", "2019-03-01 00:25:55.348996"], ["album_id", 6], ["title", "klfdjslk"], ["ord", 2], ["type_track", "bonus"]]

  def edit
    # /tracks/:id/edit
    @track = Track.find_by(id: params[:id])
    @albums = Album.all
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "albums".* FROM "albums"

  def update
    @track = Track.find_by(id: params[:id])

    if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "    \r\n  klfjdsf\r\nklfjwflkd\r\nklfjwlf\r\nkjlwkf"], ["updated_at", "2019-03-01 04:31:32.277421"], ["id", 1]]

  def destroy
    @track = Track.find_by(id: params[:id])
    if @track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]